# Question 1 Part 1
- Use ‘vehicle_collisions’ data set
- For each month in 2016, find out the percentage of collisions in Manhattan out of that year's total accidents in New York City
- Display a few rows of the output use df.head()
- Generate a csv output with four columns (‘Month’, ‘Manhattan’, ‘NYC’, ‘Percentage’)

In [46]:
import pandas as pd

In [47]:
# import csv file to Dataframe
# check how many rows are there for each district (not necessarily)
df = pd.read_csv('Data/vehicle_collisions.csv')
borough_count = df['BOROUGH'].value_counts()
borough_count

BROOKLYN         104961
QUEENS            89655
MANHATTAN         83602
BRONX             46124
STATEN ISLAND     14048
Name: BOROUGH, dtype: int64

In [48]:
# get rows of year 2016
df = df[df.apply(lambda x: x['DATE'].split('/')[2] == '16', axis=1)]
df.head(3)

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR
217539,3374565,1/1/16,0:01,MANHATTAN,10022.0,40.760223,-73.967462,"(40.7602226, -73.967462)",EAST 57 STREET,3 AVENUE,...,PASSENGER VEHICLE,PASSENGER VEHICLE,NaN,NaN,NaN,OTHER VEHICULAR,OTHER VEHICULAR,NaN,NaN,NaN
217540,3511927,1/1/16,0:01,BROOKLYN,11235.0,NaN,NaN,NaN,EMMONS AVENUE,OCEAN AVENUE,...,PASSENGER VEHICLE,BICYCLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN
217541,3363408,1/1/16,0:01,MANHATTAN,10035.0,40.805057,-73.939034,"(40.8050573, -73.9390342)",EAST 125 STREET,PARK AVENUE,...,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,UNSPECIFIED,NaN,NaN,NaN,NaN

In [49]:
# count totals in each month in whole NYC
total_count = df['DATE'].apply(lambda x: x.split('/')[0]).value_counts()
total_count

5     20052
7     19867
8     19678
10    19666
9     19492
6     19433
11    19315
12    19214
3     18471
4     18331
1     18101
2     15985
Name: DATE, dtype: int64

In [50]:
# count numbers in each month in Manhattan
df_man = df[df.apply(lambda x: x['BOROUGH'] == 'MANHATTAN', axis=1)]
man_count = df_man['DATE'].apply(lambda x: x.split('/')[0]).value_counts()
man_count

4     3540
3     3479
5     3432
2     3195
1     3178
7     3055
6     2956
8     2844
11    2838
10    2831
9     2744
12    2634
Name: DATE, dtype: int64

In [51]:
# join two series to Dataframe
output_df = pd.concat([man_count, total_count], axis=1)
# name the columns
output_df.columns = ['MANHATTAN', 'NYC']
# change indices(months) to int
output_df.index = output_df.index.map(int)
# sort by index (from Jan to Dec)
output_df.sort_index(inplace=True)
output_df.head(3)

   MANHATTAN    NYC
1       3178  18101
2       3195  15985
3       3479  18471

In [66]:
# sum up and get total in the last row
output_df2 = output_df.append(output_df.sum(numeric_only=True), ignore_index=True)
# name the index column
output_df2.columns.name = 'MONTH'
output_df2.tail(2)
# row with index = 12 is the total of collisions in whole year

MONTH  MANHATTAN     NYC
11          2634   19214
12         36726  227605

In [67]:
# calculate percentage
output_df2['PERCENTAGE'] = output_df2['MANHATTAN']/output_df2['NYC']
# rename indices as months
output_df3 = output_df2.rename(index={0: 'Jan', 1: 'Feb', 2: 'Mar', 3: 'Apr', 4: 'May', 5: 'Jun', 6: 'Jul', 7: 'Aug', 8: 'Sep', 9: 'Oct', 10: 'Nov', 11: 'Dec', 12: 'Total'})
output_df3.tail(3)

MONTH  MANHATTAN     NYC  PERCENTAGE
Nov         2838   19315    0.146932
Dec         2634   19214    0.137088
Total      36726  227605    0.161358

In [68]:
# save to csv
output_df3.to_csv('output_csv/q1p1_output.csv',index=True,header=True,index_label='MONTH')